app/controllers/datafiles_controller.rb

INSERT INTO `datafiles` (`file_path`, `created_at`, `updated_at`, `file_name`, `user_id`, `file_size`, `file_share`, `file_type`) VALUES('public/data/import javax.doc', '2011-05-23 10:04:22', '2011-05-23 10:04:22', 'import javax.doc', 1, 84480, 0, 'application/msword')
---
  def create
    @target_file = Datafile.save(params[:upload],session[:id])

SELECT * FROM `datafiles` WHERE (`datafiles`.`user_id` = 1) ORDER BY file_type desc
---
  def edit
    case params[:ffield]
    when 'file_type','file_size','file_name'
      @fileslist = Datafile.find_all_by_user_id(session[:id], :order => "#{params[:ffield]} #{params[:order]}")

SELECT * FROM `datafiles` WHERE (`datafiles`.`user_id` IS NULL AND `datafiles`.`id` = 13) LIMIT 1
UPDATE `datafiles` SET `updated_at` = '2011-05-23 11:38:24', `file_share` = 0 WHERE `id` = 1
DELETE FROM `datafiles` WHERE `id` = 1
---
  def change
    if request.post?
      access_ids = params[:access_id].collect {|id| id.to_i} if params[:access_id]
      delete_ids = params[:deleteFiles].collect {|id| id.to_i} if params[:deleteFiles]
      if access_ids
        flash[:notice] = "Files successfully updated"
        access_ids.each do |id|
          sf = Datafile.find_by_id_and_user_id(id,session[:id])
          if sf.file_share
            sf.file_share = false
          else
            sf.file_share = true
          end
          sf.save
        end
      end
      if delete_ids
        flash[:notice] = "Files successfully deleted"
        Datafile.destroy(delete_ids)

SELECT * FROM `datafiles` WHERE (`datafiles`.user_id = 3) ORDER BY id asc
---
  def index
    case params[:ffield]
    when 'file_type','file_size','file_name'
      @fileslist = Datafile.find(:all, :order => "#{params[:ffield]} #{params[:order]}")

SELECT * FROM `datafiles` WHERE (file_share = 1 AND user_id <> 3) ORDER BY file_type desc
---
  def show

    case params[:ffield]
    when 'file_type','file_size','file_name'
      @fileslist = Datafile.find(:all, :conditions =>["file_share = ? AND user_id <> ?", true, session[:id]], :order => "#{params[:ffield]} #{params[:order]}")