app/controllers/datafiles_controller.rb

  def new
    @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)

  def create
    @user = User.find(params[:user_id])

      name =  params[:upload]['datafile'].original_filename
      file_ext = File.extname(name)
      arr_types = Array['.doc','.rtf','.ppt','.pps']

    if (arr_types.include?(file_ext))
      directory = "public/data"
      fpath = File.join(directory, name)
      ftype =  params[:upload]['datafile'].content_type
      fsize =  params[:upload]['datafile'].size
      begin
        find_fl = @user.datafiles.find_by_file_name(name)
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)
SELECT * FROM `datafiles` WHERE (`datafiles`.`file_name` = 'import javax.doc') AND (`datafiles`.user_id = 3) LIMIT 1

  def index
    @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1

  def change
    if request.post?
      @user = User.find(params[:user_id])
      access_ids = params[:access_id].collect {|id| id.to_i} if params[:access_id]
      delete_ids = params[:deleteFiles].collect {|id| id.to_i} if params[:deleteFiles]
      if access_ids
        flash[:notice] = "Files successfully updated"
        access_ids.each do |id|
          sf = @user.datafiles.find(id)
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)
SELECT * FROM `datafiles` WHERE (`datafiles`.`id` = 12 AND (`datafiles`.user_id = 3))

  def allUsers
    @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)

  def showOther
    @user = User.find(params[:user_id])
    case params[:ffield]
    when 'file_type','file_size','file_name'
      @fileslist = Datafile.find(:all, :conditions =>["file_share = ? AND user_id <> ?", true, params[:user_id]], :order => "#{params[:ffield]} #{params[:order]}")
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)
SELECT * FROM `datafiles` WHERE (file_share = 1 AND user_id <> NULL) ORDER BY user_id asc