app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', '864dc5611ebda1b3328440c9d053796d571ca0b1', '2011-05-23 07:05:12', '3ccae0ab3aa645af8d8256510bf1a4d874d2951d', NULL, '2011-05-23 07:05:12', NULL, 'ssssss', 'st@gfd.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    success = @user && @user.save